Repository: collective/collective.twitter.tweet
Catalog: src/collective/twitter/tweet/locales/*/LC_MESSAGES/collective.twitter.tweet.po
Languages: es

source: Choose a twitter account to use.
es: Seleccione una cuenta de twitter para usar.

source: Could not publish to twitter, seems the account ${account} was removed from the list of authorized accounts for this site.
es: No se pudo publicar a twitter, parece que la cuenta ${account} ha sido removida de la lista de cuentas autorizadas para este sitio.

source: First Valid Account
es: Primera Cuenta Válida

source: Select account
es: Seleccione la cuenta

source: Send a tweet containing the content's title and a shortened URL to it.
es: Enviar un tweet conteniendo el título del contenido y una URL acortada al mismo.

source: Separate host
es: Host separado

source: Specify here a different host to use for the link. (make sure to include the protocol. ie. http://, https://, etc.)
es: Especifique aquí un host distinto para usar para el link. (Asegúrese de incluir el protocolo. ej. http://, https://, etc.)

source: There was an error while sending the tweet: ${error}
es: Ha habido un error mientras se enviaba el tweet: ${error}

source: Tweet new content's title and url.
es: Enviar tweet con el titulo del contenido y url.

source: Tweet sent: ${tweet}
es: Tweet enviado: ${tweet}

source: Twitter account
es: Cuenta de Twitter

source: Twitter account: ${tw_account}
es: Cuenta de Twitter: ${tw_account}
